{
  "storage" : "model.espresso.weights",
  "analyses" : {

  },
  "properties" : {

  },
  "format_version" : 200,
  "metadata_in_weights" : [

  ],
  "layers" : [
    {
      "pad_r" : 3,
      "fused_relu" : 1,
      "fused_tanh" : 0,
      "debug_info" : "conv1",
      "pad_fill_mode" : 0,
      "pad_b" : 3,
      "pad_l" : 3,
      "top" : "activation_1_output",
      "K" : 3,
      "blob_biases" : 1,
      "stride_x" : 2,
      "name" : "conv1",
      "has_batch_norm" : 0,
      "type" : "convolution",
      "n_groups" : 1,
      "pad_t" : 3,
      "stride_y" : 2,
      "has_biases" : 1,
      "C" : 64,
      "bottom" : "image",
      "weights" : {
        "W_U8" : 3,
        "lut_to_float32" : 5
      },
      "Nx" : 7,
      "pad_mode" : 0,
      "pad_value" : 0,
      "Ny" : 7,
      "n_parallel" : 1
    },
    {
      "pad_r" : 0,
      "debug_info" : "maxpooling2d_1",
      "pad_fill_mode" : 0,
      "pad_b" : 0,
      "pad_l" : 0,
      "size_x" : 3,
      "top" : "maxpooling2d_1_output",
      "top_shape_style" : 0,
      "stride_x" : 2,
      "avg_or_max" : 1,
      "average_count_exclude_padding" : 1,
      "type" : "pool",
      "name" : "maxpooling2d_1",
      "pad_t" : 0,
      "stride_y" : 2,
      "bottom" : "activation_1_output",
      "weights" : {

      },
      "pad_mode" : 2,
      "size_y" : 3,
      "pad_value" : 0
    },
    {
      "pad_r" : 0,
      "fused_relu" : 1,
      "fused_tanh" : 0,
      "debug_info" : "res2a_branch2a",
      "pad_fill_mode" : 0,
      "pad_b" : 0,
      "pad_l" : 0,
      "top" : "activation_2_output",
      "K" : 64,
      "blob_biases" : 7,
      "name" : "res2a_branch2a",
      "has_batch_norm" : 0,
      "type" : "convolution",
      "n_groups" : 1,
      "pad_t" : 0,
      "has_biases" : 1,
      "C" : 64,
      "bottom" : "maxpooling2d_1_output",
      "weights" : {
        "W_U8" : 9,
        "lut_to_float32" : 11
      },
      "Nx" : 1,
      "pad_mode" : 0,
      "pad_value" : 0,
      "Ny" : 1,
      "n_parallel" : 1
    },
    {
      "pad_r" : 0,
      "fused_relu" : 1,
      "fused_tanh" : 0,
      "debug_info" : "res2a_branch2b",
      "pad_fill_mode" : 0,
      "pad_b" : 0,
      "pad_l" : 0,
      "top" : "activation_3_output",
      "K" : 64,
      "blob_biases" : 13,
      "name" : "res2a_branch2b",
      "has_batch_norm" : 0,
      "type" : "convolution",
      "n_groups" : 1,
      "pad_t" : 0,
      "has_biases" : 1,
      "C" : 64,
      "bottom" : "activation_2_output",
      "weights" : {
        "W_U8" : 15,
        "lut_to_float32" : 17
      },
      "Nx" : 3,
      "pad_mode" : 1,
      "pad_value" : 0,
      "Ny" : 3,
      "n_parallel" : 1
    },
    {
      "pad_r" : 0,
      "fused_relu" : 0,
      "fused_tanh" : 0,
      "debug_info" : "res2a_branch2c",
      "pad_fill_mode" : 0,
      "pad_b" : 0,
      "pad_l" : 0,
      "top" : "bn2a_branch2c_output",
      "K" : 64,
      "blob_biases" : 19,
      "name" : "res2a_branch2c",
      "has_batch_norm" : 0,
      "type" : "convolution",
      "n_groups" : 1,
      "pad_t" : 0,
      "has_biases" : 1,
      "C" : 256,
      "bottom" : "activation_3_output",
      "weights" : {
        "W_U8" : 21,
        "lut_to_float32" : 23
      },
      "Nx" : 1,
      "pad_mode" : 0,
      "pad_value" : 0,
      "Ny" : 1,
      "n_parallel" : 1
    },
    {
      "pad_r" : 0,
      "fused_relu" : 0,
      "fused_tanh" : 0,
      "debug_info" : "res2a_branch1",
      "pad_fill_mode" : 0,
      "pad_b" : 0,
      "pad_l" : 0,
      "top" : "bn2a_branch1_output",
      "K" : 64,
      "blob_biases" : 25,
      "name" : "res2a_branch1",
      "has_batch_norm" : 0,
      "type" : "convolution",
      "n_groups" : 1,
      "pad_t" : 0,
      "has_biases" : 1,
      "C" : 256,
      "bottom" : "maxpooling2d_1_output",
      "weights" : {
        "W_U8" : 27,
        "lut_to_float32" : 29
      },
      "Nx" : 1,
      "pad_mode" : 0,
      "pad_value" : 0,
      "Ny" : 1,
      "n_parallel" : 1
    },
    {
      "bottom" : "bn2a_branch2c_output,bn2a_branch1_output",
      "alpha" : 1,
      "operation" : 0,
      "weights" : {

      },
      "fused_relu" : 0,
      "debug_info" : "merge_1",
      "top" : "merge_1_output",
      "type" : "elementwise",
      "name" : "merge_1",
      "beta" : 0
    },
    {
      "bottom" : "merge_1_output",
      "weights" : {

      },
      "mode" : 0,
      "debug_info" : "activation_4",
      "top" : "activation_4_output",
      "type" : "activation",
      "name" : "activation_4"
    },
    {
      "pad_r" : 0,
      "fused_relu" : 1,
      "fused_tanh" : 0,
      "debug_info" : "res2b_branch2a",
      "pad_fill_mode" : 0,
      "pad_b" : 0,
      "pad_l" : 0,
      "top" : "activation_5_output",
      "K" : 256,
      "blob_biases" : 31,
      "name" : "res2b_branch2a",
      "has_batch_norm" : 0,
      "type" : "convolution",
      "n_groups" : 1,
      "pad_t" : 0,
      "has_biases" : 1,
      "C" : 64,
      "bottom" : "activation_4_output",
      "weights" : {
        "W_U8" : 33,
        "lut_to_float32" : 35
      },
      "Nx" : 1,
      "pad_mode" : 0,
      "pad_value" : 0,
      "Ny" : 1,
      "n_parallel" : 1
    },
    {
      "pad_r" : 0,
      "fused_relu" : 1,
      "fused_tanh" : 0,
      "debug_info" : "res2b_branch2b",
      "pad_fill_mode" : 0,
      "pad_b" : 0,
      "pad_l" : 0,
      "top" : "activation_6_output",
      "K" : 64,
      "blob_biases" : 37,
      "name" : "res2b_branch2b",
      "has_batch_norm" : 0,
      "type" : "convolution",
      "n_groups" : 1,
      "pad_t" : 0,
      "has_biases" : 1,
      "C" : 64,
      "bottom" : "activation_5_output",
      "weights" : {
        "W_U8" : 39,
        "lut_to_float32" : 41
      },
      "Nx" : 3,
      "pad_mode" : 1,
      "pad_value" : 0,
      "Ny" : 3,
      "n_parallel" : 1
    },
    {
      "pad_r" : 0,
      "fused_relu" : 0,
      "fused_tanh" : 0,
      "debug_info" : "res2b_branch2c",
      "pad_fill_mode" : 0,
      "pad_b" : 0,
      "pad_l" : 0,
      "top" : "bn2b_branch2c_output",
      "K" : 64,
      "blob_biases" : 43,
      "name" : "res2b_branch2c",
      "has_batch_norm" : 0,
      "type" : "convolution",
      "n_groups" : 1,
      "pad_t" : 0,
      "has_biases" : 1,
      "C" : 256,
      "bottom" : "activation_6_output",
      "weights" : {
        "W_U8" : 45,
        "lut_to_float32" : 47
      },
      "Nx" : 1,
      "pad_mode" : 0,
      "pad_value" : 0,
      "Ny" : 1,
      "n_parallel" : 1
    },
    {
      "bottom" : "bn2b_branch2c_output,activation_4_output",
      "alpha" : 1,
      "operation" : 0,
      "weights" : {

      },
      "fused_relu" : 0,
      "debug_info" : "merge_2",
      "top" : "merge_2_output",
      "type" : "elementwise",
      "name" : "merge_2",
      "beta" : 0
    },
    {
      "bottom" : "merge_2_output",
      "weights" : {

      },
      "mode" : 0,
      "debug_info" : "activation_7",
      "top" : "activation_7_output",
      "type" : "activation",
      "name" : "activation_7"
    },
    {
      "pad_r" : 0,
      "fused_relu" : 1,
      "fused_tanh" : 0,
      "debug_info" : "res2c_branch2a",
      "pad_fill_mode" : 0,
      "pad_b" : 0,
      "pad_l" : 0,
      "top" : "activation_8_output",
      "K" : 256,
      "blob_biases" : 49,
      "name" : "res2c_branch2a",
      "has_batch_norm" : 0,
      "type" : "convolution",
      "n_groups" : 1,
      "pad_t" : 0,
      "has_biases" : 1,
      "C" : 64,
      "bottom" : "activation_7_output",
      "weights" : {
        "W_U8" : 51,
        "lut_to_float32" : 53
      },
      "Nx" : 1,
      "pad_mode" : 0,
      "pad_value" : 0,
      "Ny" : 1,
      "n_parallel" : 1
    },
    {
      "pad_r" : 0,
      "fused_relu" : 1,
      "fused_tanh" : 0,
      "debug_info" : "res2c_branch2b",
      "pad_fill_mode" : 0,
      "pad_b" : 0,
      "pad_l" : 0,
      "top" : "activation_9_output",
      "K" : 64,
      "blob_biases" : 55,
      "name" : "res2c_branch2b",
      "has_batch_norm" : 0,
      "type" : "convolution",
      "n_groups" : 1,
      "pad_t" : 0,
      "has_biases" : 1,
      "C" : 64,
      "bottom" : "activation_8_output",
      "weights" : {
        "W_U8" : 57,
        "lut_to_float32" : 59
      },
      "Nx" : 3,
      "pad_mode" : 1,
      "pad_value" : 0,
      "Ny" : 3,
      "n_parallel" : 1
    },
    {
      "pad_r" : 0,
      "fused_relu" : 0,
      "fused_tanh" : 0,
      "debug_info" : "res2c_branch2c",
      "pad_fill_mode" : 0,
      "pad_b" : 0,
      "pad_l" : 0,
      "top" : "bn2c_branch2c_output",
      "K" : 64,
      "blob_biases" : 61,
      "name" : "res2c_branch2c",
      "has_batch_norm" : 0,
      "type" : "convolution",
      "n_groups" : 1,
      "pad_t" : 0,
      "has_biases" : 1,
      "C" : 256,
      "bottom" : "activation_9_output",
      "weights" : {
        "W_U8" : 63,
        "lut_to_float32" : 65
      },
      "Nx" : 1,
      "pad_mode" : 0,
      "pad_value" : 0,
      "Ny" : 1,
      "n_parallel" : 1
    },
    {
      "bottom" : "bn2c_branch2c_output,activation_7_output",
      "alpha" : 1,
      "operation" : 0,
      "weights" : {

      },
      "fused_relu" : 0,
      "debug_info" : "merge_3",
      "top" : "merge_3_output",
      "type" : "elementwise",
      "name" : "merge_3",
      "beta" : 0
    },
    {
      "bottom" : "merge_3_output",
      "weights" : {

      },
      "mode" : 0,
      "debug_info" : "activation_10",
      "top" : "activation_10_output",
      "type" : "activation",
      "name" : "activation_10"
    },
    {
      "pad_r" : 0,
      "fused_relu" : 1,
      "fused_tanh" : 0,
      "debug_info" : "res3a_branch2a",
      "pad_fill_mode" : 0,
      "pad_b" : 0,
      "pad_l" : 0,
      "top" : "activation_11_output",
      "K" : 256,
      "blob_biases" : 67,
      "stride_x" : 2,
      "name" : "res3a_branch2a",
      "has_batch_norm" : 0,
      "type" : "convolution",
      "n_groups" : 1,
      "pad_t" : 0,
      "stride_y" : 2,
      "has_biases" : 1,
      "C" : 128,
      "bottom" : "activation_10_output",
      "weights" : {
        "W_U8" : 69,
        "lut_to_float32" : 71
      },
      "Nx" : 1,
      "pad_mode" : 0,
      "pad_value" : 0,
      "Ny" : 1,
      "n_parallel" : 1
    },
    {
      "pad_r" : 0,
      "fused_relu" : 1,
      "fused_tanh" : 0,
      "debug_info" : "res3a_branch2b",
      "pad_fill_mode" : 0,
      "pad_b" : 0,
      "pad_l" : 0,
      "top" : "activation_12_output",
      "K" : 128,
      "blob_biases" : 73,
      "name" : "res3a_branch2b",
      "has_batch_norm" : 0,
      "type" : "convolution",
      "n_groups" : 1,
      "pad_t" : 0,
      "has_biases" : 1,
      "C" : 128,
      "bottom" : "activation_11_output",
      "weights" : {
        "W_U8" : 75,
        "lut_to_float32" : 77
      },
      "Nx" : 3,
      "pad_mode" : 1,
      "pad_value" : 0,
      "Ny" : 3,
      "n_parallel" : 1
    },
    {
      "pad_r" : 0,
      "fused_relu" : 0,
      "fused_tanh" : 0,
      "debug_info" : "res3a_branch2c",
      "pad_fill_mode" : 0,
      "pad_b" : 0,
      "pad_l" : 0,
      "top" : "bn3a_branch2c_output",
      "K" : 128,
      "blob_biases" : 79,
      "name" : "res3a_branch2c",
      "has_batch_norm" : 0,
      "type" : "convolution",
      "n_groups" : 1,
      "pad_t" : 0,
      "has_biases" : 1,
      "C" : 512,
      "bottom" : "activation_12_output",
      "weights" : {
        "W_U8" : 81,
        "lut_to_float32" : 83
      },
      "Nx" : 1,
      "pad_mode" : 0,
      "pad_value" : 0,
      "Ny" : 1,
      "n_parallel" : 1
    },
    {
      "pad_r" : 0,
      "fused_relu" : 0,
      "fused_tanh" : 0,
      "debug_info" : "res3a_branch1",
      "pad_fill_mode" : 0,
      "pad_b" : 0,
      "pad_l" : 0,
      "top" : "bn3a_branch1_output",
      "K" : 256,
      "blob_biases" : 85,
      "stride_x" : 2,
      "name" : "res3a_branch1",
      "has_batch_norm" : 0,
      "type" : "convolution",
      "n_groups" : 1,
      "pad_t" : 0,
      "stride_y" : 2,
      "has_biases" : 1,
      "C" : 512,
      "bottom" : "activation_10_output",
      "weights" : {
        "W_U8" : 87,
        "lut_to_float32" : 89
      },
      "Nx" : 1,
      "pad_mode" : 0,
      "pad_value" : 0,
      "Ny" : 1,
      "n_parallel" : 1
    },
    {
      "bottom" : "bn3a_branch2c_output,bn3a_branch1_output",
      "alpha" : 1,
      "operation" : 0,
      "weights" : {

      },
      "fused_relu" : 0,
      "debug_info" : "merge_4",
      "top" : "merge_4_output",
      "type" : "elementwise",
      "name" : "merge_4",
      "beta" : 0
    },
    {
      "bottom" : "merge_4_output",
      "weights" : {

      },
      "mode" : 0,
      "debug_info" : "activation_13",
      "top" : "activation_13_output",
      "type" : "activation",
      "name" : "activation_13"
    },
    {
      "pad_r" : 0,
      "fused_relu" : 1,
      "fused_tanh" : 0,
      "debug_info" : "res3b_branch2a",
      "pad_fill_mode" : 0,
      "pad_b" : 0,
      "pad_l" : 0,
      "top" : "activation_14_output",
      "K" : 512,
      "blob_biases" : 91,
      "name" : "res3b_branch2a",
      "has_batch_norm" : 0,
      "type" : "convolution",
      "n_groups" : 1,
      "pad_t" : 0,
      "has_biases" : 1,
      "C" : 128,
      "bottom" : "activation_13_output",
      "weights" : {
        "W_U8" : 93,
        "lut_to_float32" : 95
      },
      "Nx" : 1,
      "pad_mode" : 0,
      "pad_value" : 0,
      "Ny" : 1,
      "n_parallel" : 1
    },
    {
      "pad_r" : 0,
      "fused_relu" : 1,
      "fused_tanh" : 0,
      "debug_info" : "res3b_branch2b",
      "pad_fill_mode" : 0,
      "pad_b" : 0,
      "pad_l" : 0,
      "top" : "activation_15_output",
      "K" : 128,
      "blob_biases" : 97,
      "name" : "res3b_branch2b",
      "has_batch_norm" : 0,
      "type" : "convolution",
      "n_groups" : 1,
      "pad_t" : 0,
      "has_biases" : 1,
      "C" : 128,
      "bottom" : "activation_14_output",
      "weights" : {
        "W_U8" : 99,
        "lut_to_float32" : 101
      },
      "Nx" : 3,
      "pad_mode" : 1,
      "pad_value" : 0,
      "Ny" : 3,
      "n_parallel" : 1
    },
    {
      "pad_r" : 0,
      "fused_relu" : 0,
      "fused_tanh" : 0,
      "debug_info" : "res3b_branch2c",
      "pad_fill_mode" : 0,
      "pad_b" : 0,
      "pad_l" : 0,
      "top" : "bn3b_branch2c_output",
      "K" : 128,
      "blob_biases" : 103,
      "name" : "res3b_branch2c",
      "has_batch_norm" : 0,
      "type" : "convolution",
      "n_groups" : 1,
      "pad_t" : 0,
      "has_biases" : 1,
      "C" : 512,
      "bottom" : "activation_15_output",
      "weights" : {
        "W_U8" : 105,
        "lut_to_float32" : 107
      },
      "Nx" : 1,
      "pad_mode" : 0,
      "pad_value" : 0,
      "Ny" : 1,
      "n_parallel" : 1
    },
    {
      "bottom" : "bn3b_branch2c_output,activation_13_output",
      "alpha" : 1,
      "operation" : 0,
      "weights" : {

      },
      "fused_relu" : 0,
      "debug_info" : "merge_5",
      "top" : "merge_5_output",
      "type" : "elementwise",
      "name" : "merge_5",
      "beta" : 0
    },
    {
      "bottom" : "merge_5_output",
      "weights" : {

      },
      "mode" : 0,
      "debug_info" : "activation_16",
      "top" : "activation_16_output",
      "type" : "activation",
      "name" : "activation_16"
    },
    {
      "pad_r" : 0,
      "fused_relu" : 1,
      "fused_tanh" : 0,
      "debug_info" : "res3c_branch2a",
      "pad_fill_mode" : 0,
      "pad_b" : 0,
      "pad_l" : 0,
      "top" : "activation_17_output",
      "K" : 512,
      "blob_biases" : 109,
      "name" : "res3c_branch2a",
      "has_batch_norm" : 0,
      "type" : "convolution",
      "n_groups" : 1,
      "pad_t" : 0,
      "has_biases" : 1,
      "C" : 128,
      "bottom" : "activation_16_output",
      "weights" : {
        "W_U8" : 111,
        "lut_to_float32" : 113
      },
      "Nx" : 1,
      "pad_mode" : 0,
      "pad_value" : 0,
      "Ny" : 1,
      "n_parallel" : 1
    },
    {
      "pad_r" : 0,
      "fused_relu" : 1,
      "fused_tanh" : 0,
      "debug_info" : "res3c_branch2b",
      "pad_fill_mode" : 0,
      "pad_b" : 0,
      "pad_l" : 0,
      "top" : "activation_18_output",
      "K" : 128,
      "blob_biases" : 115,
      "name" : "res3c_branch2b",
      "has_batch_norm" : 0,
      "type" : "convolution",
      "n_groups" : 1,
      "pad_t" : 0,
      "has_biases" : 1,
      "C" : 128,
      "bottom" : "activation_17_output",
      "weights" : {
        "W_U8" : 117,
        "lut_to_float32" : 119
      },
      "Nx" : 3,
      "pad_mode" : 1,
      "pad_value" : 0,
      "Ny" : 3,
      "n_parallel" : 1
    },
    {
      "pad_r" : 0,
      "fused_relu" : 0,
      "fused_tanh" : 0,
      "debug_info" : "res3c_branch2c",
      "pad_fill_mode" : 0,
      "pad_b" : 0,
      "pad_l" : 0,
      "top" : "bn3c_branch2c_output",
      "K" : 128,
      "blob_biases" : 121,
      "name" : "res3c_branch2c",
      "has_batch_norm" : 0,
      "type" : "convolution",
      "n_groups" : 1,
      "pad_t" : 0,
      "has_biases" : 1,
      "C" : 512,
      "bottom" : "activation_18_output",
      "weights" : {
        "W_U8" : 123,
        "lut_to_float32" : 125
      },
      "Nx" : 1,
      "pad_mode" : 0,
      "pad_value" : 0,
      "Ny" : 1,
      "n_parallel" : 1
    },
    {
      "bottom" : "bn3c_branch2c_output,activation_16_output",
      "alpha" : 1,
      "operation" : 0,
      "weights" : {

      },
      "fused_relu" : 0,
      "debug_info" : "merge_6",
      "top" : "merge_6_output",
      "type" : "elementwise",
      "name" : "merge_6",
      "beta" : 0
    },
    {
      "bottom" : "merge_6_output",
      "weights" : {

      },
      "mode" : 0,
      "debug_info" : "activation_19",
      "top" : "activation_19_output",
      "type" : "activation",
      "name" : "activation_19"
    },
    {
      "pad_r" : 0,
      "fused_relu" : 1,
      "fused_tanh" : 0,
      "debug_info" : "res3d_branch2a",
      "pad_fill_mode" : 0,
      "pad_b" : 0,
      "pad_l" : 0,
      "top" : "activation_20_output",
      "K" : 512,
      "blob_biases" : 127,
      "name" : "res3d_branch2a",
      "has_batch_norm" : 0,
      "type" : "convolution",
      "n_groups" : 1,
      "pad_t" : 0,
      "has_biases" : 1,
      "C" : 128,
      "bottom" : "activation_19_output",
      "weights" : {
        "W_U8" : 129,
        "lut_to_float32" : 131
      },
      "Nx" : 1,
      "pad_mode" : 0,
      "pad_value" : 0,
      "Ny" : 1,
      "n_parallel" : 1
    },
    {
      "pad_r" : 0,
      "fused_relu" : 1,
      "fused_tanh" : 0,
      "debug_info" : "res3d_branch2b",
      "pad_fill_mode" : 0,
      "pad_b" : 0,
      "pad_l" : 0,
      "top" : "activation_21_output",
      "K" : 128,
      "blob_biases" : 133,
      "name" : "res3d_branch2b",
      "has_batch_norm" : 0,
      "type" : "convolution",
      "n_groups" : 1,
      "pad_t" : 0,
      "has_biases" : 1,
      "C" : 128,
      "bottom" : "activation_20_output",
      "weights" : {
        "W_U8" : 135,
        "lut_to_float32" : 137
      },
      "Nx" : 3,
      "pad_mode" : 1,
      "pad_value" : 0,
      "Ny" : 3,
      "n_parallel" : 1
    },
    {
      "pad_r" : 0,
      "fused_relu" : 0,
      "fused_tanh" : 0,
      "debug_info" : "res3d_branch2c",
      "pad_fill_mode" : 0,
      "pad_b" : 0,
      "pad_l" : 0,
      "top" : "bn3d_branch2c_output",
      "K" : 128,
      "blob_biases" : 139,
      "name" : "res3d_branch2c",
      "has_batch_norm" : 0,
      "type" : "convolution",
      "n_groups" : 1,
      "pad_t" : 0,
      "has_biases" : 1,
      "C" : 512,
      "bottom" : "activation_21_output",
      "weights" : {
        "W_U8" : 141,
        "lut_to_float32" : 143
      },
      "Nx" : 1,
      "pad_mode" : 0,
      "pad_value" : 0,
      "Ny" : 1,
      "n_parallel" : 1
    },
    {
      "bottom" : "bn3d_branch2c_output,activation_19_output",
      "alpha" : 1,
      "operation" : 0,
      "weights" : {

      },
      "fused_relu" : 0,
      "debug_info" : "merge_7",
      "top" : "merge_7_output",
      "type" : "elementwise",
      "name" : "merge_7",
      "beta" : 0
    },
    {
      "bottom" : "merge_7_output",
      "weights" : {

      },
      "mode" : 0,
      "debug_info" : "activation_22",
      "top" : "activation_22_output",
      "type" : "activation",
      "name" : "activation_22"
    },
    {
      "pad_r" : 0,
      "fused_relu" : 1,
      "fused_tanh" : 0,
      "debug_info" : "res4a_branch2a",
      "pad_fill_mode" : 0,
      "pad_b" : 0,
      "pad_l" : 0,
      "top" : "activation_23_output",
      "K" : 512,
      "blob_biases" : 145,
      "stride_x" : 2,
      "name" : "res4a_branch2a",
      "has_batch_norm" : 0,
      "type" : "convolution",
      "n_groups" : 1,
      "pad_t" : 0,
      "stride_y" : 2,
      "has_biases" : 1,
      "C" : 256,
      "bottom" : "activation_22_output",
      "weights" : {
        "W_U8" : 147,
        "lut_to_float32" : 149
      },
      "Nx" : 1,
      "pad_mode" : 0,
      "pad_value" : 0,
      "Ny" : 1,
      "n_parallel" : 1
    },
    {
      "pad_r" : 0,
      "fused_relu" : 1,
      "fused_tanh" : 0,
      "debug_info" : "res4a_branch2b",
      "pad_fill_mode" : 0,
      "pad_b" : 0,
      "pad_l" : 0,
      "top" : "activation_24_output",
      "K" : 256,
      "blob_biases" : 151,
      "name" : "res4a_branch2b",
      "has_batch_norm" : 0,
      "type" : "convolution",
      "n_groups" : 1,
      "pad_t" : 0,
      "has_biases" : 1,
      "C" : 256,
      "bottom" : "activation_23_output",
      "weights" : {
        "W_U8" : 153,
        "lut_to_float32" : 155
      },
      "Nx" : 3,
      "pad_mode" : 1,
      "pad_value" : 0,
      "Ny" : 3,
      "n_parallel" : 1
    },
    {
      "pad_r" : 0,
      "fused_relu" : 0,
      "fused_tanh" : 0,
      "debug_info" : "res4a_branch2c",
      "pad_fill_mode" : 0,
      "pad_b" : 0,
      "pad_l" : 0,
      "top" : "bn4a_branch2c_output",
      "K" : 256,
      "blob_biases" : 157,
      "name" : "res4a_branch2c",
      "has_batch_norm" : 0,
      "type" : "convolution",
      "n_groups" : 1,
      "pad_t" : 0,
      "has_biases" : 1,
      "C" : 1024,
      "bottom" : "activation_24_output",
      "weights" : {
        "W_U8" : 159,
        "lut_to_float32" : 161
      },
      "Nx" : 1,
      "pad_mode" : 0,
      "pad_value" : 0,
      "Ny" : 1,
      "n_parallel" : 1
    },
    {
      "pad_r" : 0,
      "fused_relu" : 0,
      "fused_tanh" : 0,
      "debug_info" : "res4a_branch1",
      "pad_fill_mode" : 0,
      "pad_b" : 0,
      "pad_l" : 0,
      "top" : "bn4a_branch1_output",
      "K" : 512,
      "blob_biases" : 163,
      "stride_x" : 2,
      "name" : "res4a_branch1",
      "has_batch_norm" : 0,
      "type" : "convolution",
      "n_groups" : 1,
      "pad_t" : 0,
      "stride_y" : 2,
      "has_biases" : 1,
      "C" : 1024,
      "bottom" : "activation_22_output",
      "weights" : {
        "W_U8" : 165,
        "lut_to_float32" : 167
      },
      "Nx" : 1,
      "pad_mode" : 0,
      "pad_value" : 0,
      "Ny" : 1,
      "n_parallel" : 1
    },
    {
      "bottom" : "bn4a_branch2c_output,bn4a_branch1_output",
      "alpha" : 1,
      "operation" : 0,
      "weights" : {

      },
      "fused_relu" : 0,
      "debug_info" : "merge_8",
      "top" : "merge_8_output",
      "type" : "elementwise",
      "name" : "merge_8",
      "beta" : 0
    },
    {
      "bottom" : "merge_8_output",
      "weights" : {

      },
      "mode" : 0,
      "debug_info" : "activation_25",
      "top" : "activation_25_output",
      "type" : "activation",
      "name" : "activation_25"
    },
    {
      "pad_r" : 0,
      "fused_relu" : 1,
      "fused_tanh" : 0,
      "debug_info" : "res4b_branch2a",
      "pad_fill_mode" : 0,
      "pad_b" : 0,
      "pad_l" : 0,
      "top" : "activation_26_output",
      "K" : 1024,
      "blob_biases" : 169,
      "name" : "res4b_branch2a",
      "has_batch_norm" : 0,
      "type" : "convolution",
      "n_groups" : 1,
      "pad_t" : 0,
      "has_biases" : 1,
      "C" : 256,
      "bottom" : "activation_25_output",
      "weights" : {
        "W_U8" : 171,
        "lut_to_float32" : 173
      },
      "Nx" : 1,
      "pad_mode" : 0,
      "pad_value" : 0,
      "Ny" : 1,
      "n_parallel" : 1
    },
    {
      "pad_r" : 0,
      "fused_relu" : 1,
      "fused_tanh" : 0,
      "debug_info" : "res4b_branch2b",
      "pad_fill_mode" : 0,
      "pad_b" : 0,
      "pad_l" : 0,
      "top" : "activation_27_output",
      "K" : 256,
      "blob_biases" : 175,
      "name" : "res4b_branch2b",
      "has_batch_norm" : 0,
      "type" : "convolution",
      "n_groups" : 1,
      "pad_t" : 0,
      "has_biases" : 1,
      "C" : 256,
      "bottom" : "activation_26_output",
      "weights" : {
        "W_U8" : 177,
        "lut_to_float32" : 179
      },
      "Nx" : 3,
      "pad_mode" : 1,
      "pad_value" : 0,
      "Ny" : 3,
      "n_parallel" : 1
    },
    {
      "pad_r" : 0,
      "fused_relu" : 0,
      "fused_tanh" : 0,
      "debug_info" : "res4b_branch2c",
      "pad_fill_mode" : 0,
      "pad_b" : 0,
      "pad_l" : 0,
      "top" : "bn4b_branch2c_output",
      "K" : 256,
      "blob_biases" : 181,
      "name" : "res4b_branch2c",
      "has_batch_norm" : 0,
      "type" : "convolution",
      "n_groups" : 1,
      "pad_t" : 0,
      "has_biases" : 1,
      "C" : 1024,
      "bottom" : "activation_27_output",
      "weights" : {
        "W_U8" : 183,
        "lut_to_float32" : 185
      },
      "Nx" : 1,
      "pad_mode" : 0,
      "pad_value" : 0,
      "Ny" : 1,
      "n_parallel" : 1
    },
    {
      "bottom" : "bn4b_branch2c_output,activation_25_output",
      "alpha" : 1,
      "operation" : 0,
      "weights" : {

      },
      "fused_relu" : 0,
      "debug_info" : "merge_9",
      "top" : "merge_9_output",
      "type" : "elementwise",
      "name" : "merge_9",
      "beta" : 0
    },
    {
      "bottom" : "merge_9_output",
      "weights" : {

      },
      "mode" : 0,
      "debug_info" : "activation_28",
      "top" : "activation_28_output",
      "type" : "activation",
      "name" : "activation_28"
    },
    {
      "pad_r" : 0,
      "fused_relu" : 1,
      "fused_tanh" : 0,
      "debug_info" : "res4c_branch2a",
      "pad_fill_mode" : 0,
      "pad_b" : 0,
      "pad_l" : 0,
      "top" : "activation_29_output",
      "K" : 1024,
      "blob_biases" : 187,
      "name" : "res4c_branch2a",
      "has_batch_norm" : 0,
      "type" : "convolution",
      "n_groups" : 1,
      "pad_t" : 0,
      "has_biases" : 1,
      "C" : 256,
      "bottom" : "activation_28_output",
      "weights" : {
        "W_U8" : 189,
        "lut_to_float32" : 191
      },
      "Nx" : 1,
      "pad_mode" : 0,
      "pad_value" : 0,
      "Ny" : 1,
      "n_parallel" : 1
    },
    {
      "pad_r" : 0,
      "fused_relu" : 1,
      "fused_tanh" : 0,
      "debug_info" : "res4c_branch2b",
      "pad_fill_mode" : 0,
      "pad_b" : 0,
      "pad_l" : 0,
      "top" : "activation_30_output",
      "K" : 256,
      "blob_biases" : 193,
      "name" : "res4c_branch2b",
      "has_batch_norm" : 0,
      "type" : "convolution",
      "n_groups" : 1,
      "pad_t" : 0,
      "has_biases" : 1,
      "C" : 256,
      "bottom" : "activation_29_output",
      "weights" : {
        "W_U8" : 195,
        "lut_to_float32" : 197
      },
      "Nx" : 3,
      "pad_mode" : 1,
      "pad_value" : 0,
      "Ny" : 3,
      "n_parallel" : 1
    },
    {
      "pad_r" : 0,
      "fused_relu" : 0,
      "fused_tanh" : 0,
      "debug_info" : "res4c_branch2c",
      "pad_fill_mode" : 0,
      "pad_b" : 0,
      "pad_l" : 0,
      "top" : "bn4c_branch2c_output",
      "K" : 256,
      "blob_biases" : 199,
      "name" : "res4c_branch2c",
      "has_batch_norm" : 0,
      "type" : "convolution",
      "n_groups" : 1,
      "pad_t" : 0,
      "has_biases" : 1,
      "C" : 1024,
      "bottom" : "activation_30_output",
      "weights" : {
        "W_U8" : 201,
        "lut_to_float32" : 203
      },
      "Nx" : 1,
      "pad_mode" : 0,
      "pad_value" : 0,
      "Ny" : 1,
      "n_parallel" : 1
    },
    {
      "bottom" : "bn4c_branch2c_output,activation_28_output",
      "alpha" : 1,
      "operation" : 0,
      "weights" : {

      },
      "fused_relu" : 0,
      "debug_info" : "merge_10",
      "top" : "merge_10_output",
      "type" : "elementwise",
      "name" : "merge_10",
      "beta" : 0
    },
    {
      "bottom" : "merge_10_output",
      "weights" : {

      },
      "mode" : 0,
      "debug_info" : "activation_31",
      "top" : "activation_31_output",
      "type" : "activation",
      "name" : "activation_31"
    },
    {
      "pad_r" : 0,
      "fused_relu" : 1,
      "fused_tanh" : 0,
      "debug_info" : "res4d_branch2a",
      "pad_fill_mode" : 0,
      "pad_b" : 0,
      "pad_l" : 0,
      "top" : "activation_32_output",
      "K" : 1024,
      "blob_biases" : 205,
      "name" : "res4d_branch2a",
      "has_batch_norm" : 0,
      "type" : "convolution",
      "n_groups" : 1,
      "pad_t" : 0,
      "has_biases" : 1,
      "C" : 256,
      "bottom" : "activation_31_output",
      "weights" : {
        "W_U8" : 207,
        "lut_to_float32" : 209
      },
      "Nx" : 1,
      "pad_mode" : 0,
      "pad_value" : 0,
      "Ny" : 1,
      "n_parallel" : 1
    },
    {
      "pad_r" : 0,
      "fused_relu" : 1,
      "fused_tanh" : 0,
      "debug_info" : "res4d_branch2b",
      "pad_fill_mode" : 0,
      "pad_b" : 0,
      "pad_l" : 0,
      "top" : "activation_33_output",
      "K" : 256,
      "blob_biases" : 211,
      "name" : "res4d_branch2b",
      "has_batch_norm" : 0,
      "type" : "convolution",
      "n_groups" : 1,
      "pad_t" : 0,
      "has_biases" : 1,
      "C" : 256,
      "bottom" : "activation_32_output",
      "weights" : {
        "W_U8" : 213,
        "lut_to_float32" : 215
      },
      "Nx" : 3,
      "pad_mode" : 1,
      "pad_value" : 0,
      "Ny" : 3,
      "n_parallel" : 1
    },
    {
      "pad_r" : 0,
      "fused_relu" : 0,
      "fused_tanh" : 0,
      "debug_info" : "res4d_branch2c",
      "pad_fill_mode" : 0,
      "pad_b" : 0,
      "pad_l" : 0,
      "top" : "bn4d_branch2c_output",
      "K" : 256,
      "blob_biases" : 217,
      "name" : "res4d_branch2c",
      "has_batch_norm" : 0,
      "type" : "convolution",
      "n_groups" : 1,
      "pad_t" : 0,
      "has_biases" : 1,
      "C" : 1024,
      "bottom" : "activation_33_output",
      "weights" : {
        "W_U8" : 219,
        "lut_to_float32" : 221
      },
      "Nx" : 1,
      "pad_mode" : 0,
      "pad_value" : 0,
      "Ny" : 1,
      "n_parallel" : 1
    },
    {
      "bottom" : "bn4d_branch2c_output,activation_31_output",
      "alpha" : 1,
      "operation" : 0,
      "weights" : {

      },
      "fused_relu" : 0,
      "debug_info" : "merge_11",
      "top" : "merge_11_output",
      "type" : "elementwise",
      "name" : "merge_11",
      "beta" : 0
    },
    {
      "bottom" : "merge_11_output",
      "weights" : {

      },
      "mode" : 0,
      "debug_info" : "activation_34",
      "top" : "activation_34_output",
      "type" : "activation",
      "name" : "activation_34"
    },
    {
      "pad_r" : 0,
      "fused_relu" : 1,
      "fused_tanh" : 0,
      "debug_info" : "res4e_branch2a",
      "pad_fill_mode" : 0,
      "pad_b" : 0,
      "pad_l" : 0,
      "top" : "activation_35_output",
      "K" : 1024,
      "blob_biases" : 223,
      "name" : "res4e_branch2a",
      "has_batch_norm" : 0,
      "type" : "convolution",
      "n_groups" : 1,
      "pad_t" : 0,
      "has_biases" : 1,
      "C" : 256,
      "bottom" : "activation_34_output",
      "weights" : {
        "W_U8" : 225,
        "lut_to_float32" : 227
      },
      "Nx" : 1,
      "pad_mode" : 0,
      "pad_value" : 0,
      "Ny" : 1,
      "n_parallel" : 1
    },
    {
      "pad_r" : 0,
      "fused_relu" : 1,
      "fused_tanh" : 0,
      "debug_info" : "res4e_branch2b",
      "pad_fill_mode" : 0,
      "pad_b" : 0,
      "pad_l" : 0,
      "top" : "activation_36_output",
      "K" : 256,
      "blob_biases" : 229,
      "name" : "res4e_branch2b",
      "has_batch_norm" : 0,
      "type" : "convolution",
      "n_groups" : 1,
      "pad_t" : 0,
      "has_biases" : 1,
      "C" : 256,
      "bottom" : "activation_35_output",
      "weights" : {
        "W_U8" : 231,
        "lut_to_float32" : 233
      },
      "Nx" : 3,
      "pad_mode" : 1,
      "pad_value" : 0,
      "Ny" : 3,
      "n_parallel" : 1
    },
    {
      "pad_r" : 0,
      "fused_relu" : 0,
      "fused_tanh" : 0,
      "debug_info" : "res4e_branch2c",
      "pad_fill_mode" : 0,
      "pad_b" : 0,
      "pad_l" : 0,
      "top" : "bn4e_branch2c_output",
      "K" : 256,
      "blob_biases" : 235,
      "name" : "res4e_branch2c",
      "has_batch_norm" : 0,
      "type" : "convolution",
      "n_groups" : 1,
      "pad_t" : 0,
      "has_biases" : 1,
      "C" : 1024,
      "bottom" : "activation_36_output",
      "weights" : {
        "W_U8" : 237,
        "lut_to_float32" : 239
      },
      "Nx" : 1,
      "pad_mode" : 0,
      "pad_value" : 0,
      "Ny" : 1,
      "n_parallel" : 1
    },
    {
      "bottom" : "bn4e_branch2c_output,activation_34_output",
      "alpha" : 1,
      "operation" : 0,
      "weights" : {

      },
      "fused_relu" : 0,
      "debug_info" : "merge_12",
      "top" : "merge_12_output",
      "type" : "elementwise",
      "name" : "merge_12",
      "beta" : 0
    },
    {
      "bottom" : "merge_12_output",
      "weights" : {

      },
      "mode" : 0,
      "debug_info" : "activation_37",
      "top" : "activation_37_output",
      "type" : "activation",
      "name" : "activation_37"
    },
    {
      "pad_r" : 0,
      "fused_relu" : 1,
      "fused_tanh" : 0,
      "debug_info" : "res4f_branch2a",
      "pad_fill_mode" : 0,
      "pad_b" : 0,
      "pad_l" : 0,
      "top" : "activation_38_output",
      "K" : 1024,
      "blob_biases" : 241,
      "name" : "res4f_branch2a",
      "has_batch_norm" : 0,
      "type" : "convolution",
      "n_groups" : 1,
      "pad_t" : 0,
      "has_biases" : 1,
      "C" : 256,
      "bottom" : "activation_37_output",
      "weights" : {
        "W_U8" : 243,
        "lut_to_float32" : 245
      },
      "Nx" : 1,
      "pad_mode" : 0,
      "pad_value" : 0,
      "Ny" : 1,
      "n_parallel" : 1
    },
    {
      "pad_r" : 0,
      "fused_relu" : 1,
      "fused_tanh" : 0,
      "debug_info" : "res4f_branch2b",
      "pad_fill_mode" : 0,
      "pad_b" : 0,
      "pad_l" : 0,
      "top" : "activation_39_output",
      "K" : 256,
      "blob_biases" : 247,
      "name" : "res4f_branch2b",
      "has_batch_norm" : 0,
      "type" : "convolution",
      "n_groups" : 1,
      "pad_t" : 0,
      "has_biases" : 1,
      "C" : 256,
      "bottom" : "activation_38_output",
      "weights" : {
        "W_U8" : 249,
        "lut_to_float32" : 251
      },
      "Nx" : 3,
      "pad_mode" : 1,
      "pad_value" : 0,
      "Ny" : 3,
      "n_parallel" : 1
    },
    {
      "pad_r" : 0,
      "fused_relu" : 0,
      "fused_tanh" : 0,
      "debug_info" : "res4f_branch2c",
      "pad_fill_mode" : 0,
      "pad_b" : 0,
      "pad_l" : 0,
      "top" : "bn4f_branch2c_output",
      "K" : 256,
      "blob_biases" : 253,
      "name" : "res4f_branch2c",
      "has_batch_norm" : 0,
      "type" : "convolution",
      "n_groups" : 1,
      "pad_t" : 0,
      "has_biases" : 1,
      "C" : 1024,
      "bottom" : "activation_39_output",
      "weights" : {
        "W_U8" : 255,
        "lut_to_float32" : 257
      },
      "Nx" : 1,
      "pad_mode" : 0,
      "pad_value" : 0,
      "Ny" : 1,
      "n_parallel" : 1
    },
    {
      "bottom" : "bn4f_branch2c_output,activation_37_output",
      "alpha" : 1,
      "operation" : 0,
      "weights" : {

      },
      "fused_relu" : 0,
      "debug_info" : "merge_13",
      "top" : "merge_13_output",
      "type" : "elementwise",
      "name" : "merge_13",
      "beta" : 0
    },
    {
      "bottom" : "merge_13_output",
      "weights" : {

      },
      "mode" : 0,
      "debug_info" : "activation_40",
      "top" : "activation_40_output",
      "type" : "activation",
      "name" : "activation_40"
    },
    {
      "pad_r" : 0,
      "fused_relu" : 1,
      "fused_tanh" : 0,
      "debug_info" : "res5a_branch2a",
      "pad_fill_mode" : 0,
      "pad_b" : 0,
      "pad_l" : 0,
      "top" : "activation_41_output",
      "K" : 1024,
      "blob_biases" : 259,
      "stride_x" : 2,
      "name" : "res5a_branch2a",
      "has_batch_norm" : 0,
      "type" : "convolution",
      "n_groups" : 1,
      "pad_t" : 0,
      "stride_y" : 2,
      "has_biases" : 1,
      "C" : 512,
      "bottom" : "activation_40_output",
      "weights" : {
        "W_U8" : 261,
        "lut_to_float32" : 263
      },
      "Nx" : 1,
      "pad_mode" : 0,
      "pad_value" : 0,
      "Ny" : 1,
      "n_parallel" : 1
    },
    {
      "pad_r" : 0,
      "fused_relu" : 1,
      "fused_tanh" : 0,
      "debug_info" : "res5a_branch2b",
      "pad_fill_mode" : 0,
      "pad_b" : 0,
      "pad_l" : 0,
      "top" : "activation_42_output",
      "K" : 512,
      "blob_biases" : 265,
      "name" : "res5a_branch2b",
      "has_batch_norm" : 0,
      "type" : "convolution",
      "n_groups" : 1,
      "pad_t" : 0,
      "has_biases" : 1,
      "C" : 512,
      "bottom" : "activation_41_output",
      "weights" : {
        "W_U8" : 267,
        "lut_to_float32" : 269
      },
      "Nx" : 3,
      "pad_mode" : 1,
      "pad_value" : 0,
      "Ny" : 3,
      "n_parallel" : 1
    },
    {
      "pad_r" : 0,
      "fused_relu" : 0,
      "fused_tanh" : 0,
      "debug_info" : "res5a_branch2c",
      "pad_fill_mode" : 0,
      "pad_b" : 0,
      "pad_l" : 0,
      "top" : "bn5a_branch2c_output",
      "K" : 512,
      "blob_biases" : 271,
      "name" : "res5a_branch2c",
      "has_batch_norm" : 0,
      "type" : "convolution",
      "n_groups" : 1,
      "pad_t" : 0,
      "has_biases" : 1,
      "C" : 2048,
      "bottom" : "activation_42_output",
      "weights" : {
        "W_U8" : 273,
        "lut_to_float32" : 275
      },
      "Nx" : 1,
      "pad_mode" : 0,
      "pad_value" : 0,
      "Ny" : 1,
      "n_parallel" : 1
    },
    {
      "pad_r" : 0,
      "fused_relu" : 0,
      "fused_tanh" : 0,
      "debug_info" : "res5a_branch1",
      "pad_fill_mode" : 0,
      "pad_b" : 0,
      "pad_l" : 0,
      "top" : "bn5a_branch1_output",
      "K" : 1024,
      "blob_biases" : 277,
      "stride_x" : 2,
      "name" : "res5a_branch1",
      "has_batch_norm" : 0,
      "type" : "convolution",
      "n_groups" : 1,
      "pad_t" : 0,
      "stride_y" : 2,
      "has_biases" : 1,
      "C" : 2048,
      "bottom" : "activation_40_output",
      "weights" : {
        "W_U8" : 279,
        "lut_to_float32" : 281
      },
      "Nx" : 1,
      "pad_mode" : 0,
      "pad_value" : 0,
      "Ny" : 1,
      "n_parallel" : 1
    },
    {
      "bottom" : "bn5a_branch2c_output,bn5a_branch1_output",
      "alpha" : 1,
      "operation" : 0,
      "weights" : {

      },
      "fused_relu" : 0,
      "debug_info" : "merge_14",
      "top" : "merge_14_output",
      "type" : "elementwise",
      "name" : "merge_14",
      "beta" : 0
    },
    {
      "bottom" : "merge_14_output",
      "weights" : {

      },
      "mode" : 0,
      "debug_info" : "activation_43",
      "top" : "activation_43_output",
      "type" : "activation",
      "name" : "activation_43"
    },
    {
      "pad_r" : 0,
      "fused_relu" : 1,
      "fused_tanh" : 0,
      "debug_info" : "res5b_branch2a",
      "pad_fill_mode" : 0,
      "pad_b" : 0,
      "pad_l" : 0,
      "top" : "activation_44_output",
      "K" : 2048,
      "blob_biases" : 283,
      "name" : "res5b_branch2a",
      "has_batch_norm" : 0,
      "type" : "convolution",
      "n_groups" : 1,
      "pad_t" : 0,
      "has_biases" : 1,
      "C" : 512,
      "bottom" : "activation_43_output",
      "weights" : {
        "W_U8" : 285,
        "lut_to_float32" : 287
      },
      "Nx" : 1,
      "pad_mode" : 0,
      "pad_value" : 0,
      "Ny" : 1,
      "n_parallel" : 1
    },
    {
      "pad_r" : 0,
      "fused_relu" : 1,
      "fused_tanh" : 0,
      "debug_info" : "res5b_branch2b",
      "pad_fill_mode" : 0,
      "pad_b" : 0,
      "pad_l" : 0,
      "top" : "activation_45_output",
      "K" : 512,
      "blob_biases" : 289,
      "name" : "res5b_branch2b",
      "has_batch_norm" : 0,
      "type" : "convolution",
      "n_groups" : 1,
      "pad_t" : 0,
      "has_biases" : 1,
      "C" : 512,
      "bottom" : "activation_44_output",
      "weights" : {
        "W_U8" : 291,
        "lut_to_float32" : 293
      },
      "Nx" : 3,
      "pad_mode" : 1,
      "pad_value" : 0,
      "Ny" : 3,
      "n_parallel" : 1
    },
    {
      "pad_r" : 0,
      "fused_relu" : 0,
      "fused_tanh" : 0,
      "debug_info" : "res5b_branch2c",
      "pad_fill_mode" : 0,
      "pad_b" : 0,
      "pad_l" : 0,
      "top" : "bn5b_branch2c_output",
      "K" : 512,
      "blob_biases" : 295,
      "name" : "res5b_branch2c",
      "has_batch_norm" : 0,
      "type" : "convolution",
      "n_groups" : 1,
      "pad_t" : 0,
      "has_biases" : 1,
      "C" : 2048,
      "bottom" : "activation_45_output",
      "weights" : {
        "W_U8" : 297,
        "lut_to_float32" : 299
      },
      "Nx" : 1,
      "pad_mode" : 0,
      "pad_value" : 0,
      "Ny" : 1,
      "n_parallel" : 1
    },
    {
      "bottom" : "bn5b_branch2c_output,activation_43_output",
      "alpha" : 1,
      "operation" : 0,
      "weights" : {

      },
      "fused_relu" : 0,
      "debug_info" : "merge_15",
      "top" : "merge_15_output",
      "type" : "elementwise",
      "name" : "merge_15",
      "beta" : 0
    },
    {
      "bottom" : "merge_15_output",
      "weights" : {

      },
      "mode" : 0,
      "debug_info" : "activation_46",
      "top" : "activation_46_output",
      "type" : "activation",
      "name" : "activation_46"
    },
    {
      "pad_r" : 0,
      "fused_relu" : 1,
      "fused_tanh" : 0,
      "debug_info" : "res5c_branch2a",
      "pad_fill_mode" : 0,
      "pad_b" : 0,
      "pad_l" : 0,
      "top" : "activation_47_output",
      "K" : 2048,
      "blob_biases" : 301,
      "name" : "res5c_branch2a",
      "has_batch_norm" : 0,
      "type" : "convolution",
      "n_groups" : 1,
      "pad_t" : 0,
      "has_biases" : 1,
      "C" : 512,
      "bottom" : "activation_46_output",
      "weights" : {
        "W_U8" : 303,
        "lut_to_float32" : 305
      },
      "Nx" : 1,
      "pad_mode" : 0,
      "pad_value" : 0,
      "Ny" : 1,
      "n_parallel" : 1
    },
    {
      "pad_r" : 0,
      "fused_relu" : 1,
      "fused_tanh" : 0,
      "debug_info" : "res5c_branch2b",
      "pad_fill_mode" : 0,
      "pad_b" : 0,
      "pad_l" : 0,
      "top" : "activation_48_output",
      "K" : 512,
      "blob_biases" : 307,
      "name" : "res5c_branch2b",
      "has_batch_norm" : 0,
      "type" : "convolution",
      "n_groups" : 1,
      "pad_t" : 0,
      "has_biases" : 1,
      "C" : 512,
      "bottom" : "activation_47_output",
      "weights" : {
        "W_U8" : 309,
        "lut_to_float32" : 311
      },
      "Nx" : 3,
      "pad_mode" : 1,
      "pad_value" : 0,
      "Ny" : 3,
      "n_parallel" : 1
    },
    {
      "pad_r" : 0,
      "fused_relu" : 0,
      "fused_tanh" : 0,
      "debug_info" : "res5c_branch2c",
      "pad_fill_mode" : 0,
      "pad_b" : 0,
      "pad_l" : 0,
      "top" : "bn5c_branch2c_output",
      "K" : 512,
      "blob_biases" : 313,
      "name" : "res5c_branch2c",
      "has_batch_norm" : 0,
      "type" : "convolution",
      "n_groups" : 1,
      "pad_t" : 0,
      "has_biases" : 1,
      "C" : 2048,
      "bottom" : "activation_48_output",
      "weights" : {
        "W_U8" : 315,
        "lut_to_float32" : 317
      },
      "Nx" : 1,
      "pad_mode" : 0,
      "pad_value" : 0,
      "Ny" : 1,
      "n_parallel" : 1
    },
    {
      "bottom" : "bn5c_branch2c_output,activation_46_output",
      "alpha" : 1,
      "operation" : 0,
      "weights" : {

      },
      "fused_relu" : 0,
      "debug_info" : "merge_16",
      "top" : "merge_16_output",
      "type" : "elementwise",
      "name" : "merge_16",
      "beta" : 0
    },
    {
      "bottom" : "merge_16_output",
      "weights" : {

      },
      "mode" : 0,
      "debug_info" : "activation_49",
      "top" : "activation_49_output",
      "type" : "activation",
      "name" : "activation_49"
    },
    {
      "pad_r" : 0,
      "debug_info" : "avg_pool",
      "pad_fill_mode" : 0,
      "pad_b" : 0,
      "pad_l" : 0,
      "size_x" : 7,
      "top" : "avg_pool_output",
      "top_shape_style" : 0,
      "stride_x" : 7,
      "avg_or_max" : 0,
      "average_count_exclude_padding" : 1,
      "type" : "pool",
      "name" : "avg_pool",
      "pad_t" : 0,
      "stride_y" : 7,
      "bottom" : "activation_49_output",
      "weights" : {

      },
      "pad_mode" : 2,
      "size_y" : 7,
      "pad_value" : 0
    },
    {
      "bottom" : "avg_pool_output",
      "weights" : {

      },
      "mode" : 1,
      "hint_fallback_from_metal" : 1,
      "nd_axis" : 0,
      "debug_info" : "flatten_1",
      "attributes" : {
        "is_output" : 1
      },
      "top" : "flatten_1_output",
      "type" : "flatten",
      "name" : "flatten_1"
    }
  ]
}